tap "homebrew/bundle"

# Official Amazon AWS command-line interface
brew "awscli"
# Manage multiple Node.js versions
brew "nvm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"

# ---------------------------------------------------------------
# Git
# ---------------------------------------------------------------
# Distributed revision control system
brew "git"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GitHub command-line tool
brew "gh"

# ---------------------------------------------------------------
# Chezmoi
# ---------------------------------------------------------------
# LastPass command-line interface tool
brew "lastpass-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"

# ---------------------------------------------------------------
# VSCode
# ---------------------------------------------------------------
vscode "bfrangi.vscode-nightingale-theme"
vscode "bierner.markdown-mermaid"
vscode "Codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "sndst00m.markdown-github-dark-pack"
vscode "steoates.autoimport"
vscode "WakaTime.vscode-wakatime"
vscode "wix.vscode-import-cost"

# ---------------------------------------------------------------
# Neovim
# ---------------------------------------------------------------
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Autoformat shell script source code
brew "shfmt"
# Search tool like grep and The Silver Searcher
brew "ripgrep"

# ---------------------------------------------------------------
# Lazy Suite
# ---------------------------------------------------------------
# A simple terminal UI for docker, written in Go
tap "jesseduffield/lazydocker"
brew "jesseduffield/lazydocker/lazydocker"
# A simple terminal UI for git commands, written in Go
tap "jesseduffield/lazynpm"
brew "jesseduffield/lazynpm/lazynpm"
# Simple terminal UI for git commands
brew "lazygit"

# ---------------------------------------------------------------
# Daily tools
# ---------------------------------------------------------------
# Simple, fast and user-friendly alternative to find
brew "fd"
# Simplified and community-driven man pages
brew "tldr"
# Upgrade all the things
brew "topgrade"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Fast, highly customisable system info script
brew "neofetch"

# ---------------------------------------------------------------
# Linux
# ---------------------------------------------------------------
{{- if eq .chezmoi.os "linux" }}
tap "wez/wezterm-linuxbrew"
# A GPU-accelerated cross-platform terminal emulator and multiplexer written by @wez and implemented in Rust
brew "wez/wezterm-linuxbrew/wezterm"
{{ end -}}

# ---------------------------------------------------------------
# MacOS
# ---------------------------------------------------------------
{{- if eq .chezmoi.os "darwin" }}
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Developer targeted fonts with a high number of glyphs
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Keyboard customizer
cask "karabiner-elements"
# Snippet management app
cask "lepton"
# Web browser
cask "microsoft-edge"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
{{ end -}}

# ---------------------------------------------------------------
# Shell
# ---------------------------------------------------------------
{{- if not (contains "zsh" (env "SHELL")) }}
# UNIX shell (command interpreter)
brew "zsh"
{{ end -}}

tap "homebrew/command-not-found"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Modern, maintained replacement for ls
brew "eza"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Cross-shell prompt for astronauts
brew "starship"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# ---------------------------------------------------------------
# Misc
# ---------------------------------------------------------------
# Internet file retriever
brew "wget"
